Autodesk.Revit.DB.Mechanical.AirSystemData.IsDataCompleted
Is the required data completed for this air system?
Since:
2020

Autodesk.Revit.DB.Mechanical.AirSystemData.AirFanType
The fan type.
Since:
2020

Autodesk.Revit.DB.Mechanical.AirSystemData.ChilledWaterLoopId
The chilled water loop used for the chilled water option of cooling coil.
Since:
2020

Autodesk.Revit.DB.Mechanical.AirSystemData.CoolingCoilType
The cooling coil type. Note this property change would reset the chilled water loop.
Since:
2020

Autodesk.Revit.DB.Mechanical.AirSystemData.HeatingHotWaterLoopId
The water loop element id for the hot-water heating coil.
Since:
2020

Autodesk.Revit.DB.Mechanical.AirSystemData.HeatingCoilType
The heating coil type. Note this property change would reset the heating water loop.
Since:
2020

Autodesk.Revit.DB.Mechanical.AirSystemData.PreheatHotWaterLoopId
The water loop element id for the hot-water preheat coil.
Since:
2020

Autodesk.Revit.DB.Mechanical.AirSystemData.PreheatCoilType
The preheat coil type. Note this property change would reset the preheat water loop.
Since:
2020

Autodesk.Revit.DB.Mechanical.AirSystemData.HeatExchangerType
The type of heat exchanger.
Since:
2020

Autodesk.Revit.DB.Mechanical.AirSystemData
Represents the data and parameter of analytical air system.
Since:
2020